_posts/2025-12-28-post-active-object.md
```mermaid
sequenceDiagram
    participant Client
    participant Proxy as ActObjServantProxy
    participant Scheduler as ActObjScheduler
    participant Queue as ActivationQueue
    participant Request as RequestGetReturnMessage
    participant Servant as ActObjServant
    participant Future as Future
    participant CallBack as CallbackGetReturnMessage

    Note over Client, Proxy: Client Thread
    Client->>Proxy: requestGetReturnMessage("Hello")
    activate Proxy
    Proxy->>Future: create 
    Proxy->>Request: create
    Proxy->>Scheduler: enqueue(Request)
    Scheduler->>Queue: enqueue(Request)
    Proxy-->>Client: return Future
    deactivate Proxy
    Client->>CallBack : create 
    Client->>Future: attach(CallbackGetReturnMessage)

    Note over Scheduler, Servant: Scheduler Thread
  
    loop Scheduler Loop
        Scheduler->>Queue: dequeue()
        Queue-->>Scheduler: Request
        Scheduler->>Request: call()
        activate Request
        Request->>Servant: RequestGetReturnMessage("Hello")
        Servant-->>Request: "Echo - Hello"
        Request->>Future: set("Echo - Hello")
        Future-->>CallBack: update 
        deactivate Request
    end

    CallBack-->>Client: update(future)
    Client->>Future: get()
    Future-->>Client: "Echo - Hello"

```
